DataProcessors/ИнтеграцияУправлениеПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияУправлениеПерсоналом</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыСобытийОбменаУправлениеПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОбменаУправлениеПерсоналом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОбсуждений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПубликацияРасчетныхЛистков</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПриложенияДляИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПриложенияДляИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УправлениеПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабинетСотрудника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ИнтеграцияУправлениеПерсоналом/Forms/ВыполнитьОбменСохранитьРезультат/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СобытиеОбмена 		= Параметры.СобытиеОбмена;
	Приложение 			= Параметры.Приложение;
	
	Если Не ЗначениеЗаполнено(СобытиеОбмена) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяСобытия = "";
	Если СобытиеОбмена = Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.Обмен Тогда
		ИмяСобытия = "EventLogExchange";
	ИначеЕсли СобытиеОбмена = Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.ПубликацияРасчетныхЛистков Тогда
		ИмяСобытия = "EventLogPayslips";
	КонецЕсли;
	ИмяФайла = СтрШаблон("%1_%2", ИмяСобытия, Строка(Новый УникальныйИдентификатор));
	
	ИнтервалОжидания = ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(),1,10);
	
	ПараметрыМетода = Новый Структура;
	Если СобытиеОбмена = Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.ПубликацияРасчетныхЛистков Тогда
		ПараметрыМетода = ИнтеграцияКабинетСотрудникаОбмен.НовоеОписаниеПараметрыПубликацииРасчетныхЛистков();
		ЗаполнитьЗначенияСвойств(ПараметрыМетода, Параметры);
		ПараметрыМетода.СписокФизическихЛиц = ПолучитьИзВременногоХранилища(Параметры.АдресСпискаФизическихЛиц);
		УдалитьИзВременногоХранилища(Параметры.АдресСпискаФизическихЛиц);
	Иначе
		ПараметрыМетода.Вставить("ПодготовитьДанныеДляТехПоддержки", Истина);
	КонецЕсли;
	
	ИмяМетода = "";
	Если Приложение = Перечисления.ПриложенияДляИнтеграции.УправлениеПерсоналом
			И СобытиеОбмена = Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.Обмен Тогда
		ИмяМетода = "Интеграция1СПерсонал.ВыполнитьОбменФоновоеЗадание";
	ИначеЕсли Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника
			И СобытиеОбмена = Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.Обмен Тогда
		ИмяМетода = "ИнтеграцияКабинетСотрудника.ВыполнитьОбменФоновоеЗадание";
	ИначеЕсли Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника
			И СобытиеОбмена = Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.ПубликацияРасчетныхЛистков Тогда
		ИмяМетода = "ИнтеграцияКабинетСотрудника.ОпубликоватьРасчетныеЛистыВФоне";
	КонецЕсли;
	
	ЗапуститьФоновоеЗадание("Обмен", ИмяМетода, ПараметрыМетода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если АктивноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьВыполнениеЗадания(АктивноеЗадание.ДлительнаяОперация.ИдентификаторЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если АктивноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьВыполнениеЗадания(АктивноеЗадание.ДлительнаяОперация.ИдентификаторЗадания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитьВыполнениеЗадания(ИдентификаторЗадания)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

&НаКлиенте
Функция РезультатВыполнения()
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяСобытияОбмена", 			СобытиеОбмена);
	Результат.Вставить("РезультатВыполненияОбмена", РезультатВыполненияОбмена);
	Результат.Вставить("ПолноеИмяФайла", 			ПолноеИмяФайла);
	Результат.Вставить("СообщениеОбОшибке");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗапуститьФоновоеЗадание(ИмяЗадания, ИмяМетода, ПараметрыПроцедуры)
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
	НовоеЗадание = Новый Структура("Имя,ДлительнаяОперация");
	НовоеЗадание.Имя 				= ИмяЗадания;
	НовоеЗадание.ДлительнаяОперация = ДлительнаяОперация;
	
	АктивноеЗадание = Новый ФиксированнаяСтруктура(НовоеЗадание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНачалеЗадания()
	
	Если ЗначениеЗаполнено(АктивноеЗадание) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			АктивноеЗадание.ДлительнаяОперация,
			Новый ОписаниеОповещения("ПриЗавершенииЗадания", ЭтотОбъект, АктивноеЗадание.Имя),
			ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииЗадания(ФоновоеЗадание, ИмяЗадания) Экспорт
	
	АктивноеЗадание = Неопределено;
	
	Если ФоновоеЗадание = Неопределено Тогда
		Закрыть(РезультатВыполнения());
	ИначеЕсли ФоновоеЗадание.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении фонового задания возникла ошибка:'") + Символы.ПС + ФоновоеЗадание.КраткоеПредставлениеОшибки;
		РезультатВыполнения = РезультатВыполнения();
		РезультатВыполнения.СообщениеОбОшибке = ТекстСообщения;
		Закрыть(РезультатВыполнения);
	ИначеЕсли ФоновоеЗадание.Статус = "Выполнено" Тогда
		
		Если ИмяЗадания = "ВыгрузкаЖурналаРегистрации" Тогда
			ВыгрузкаЖурналаРегистрацииЗавершение(ФоновоеЗадание);
		Иначе
			РезультатВыполнения = ПолучитьИзВременногоХранилища(ФоновоеЗадание.АдресРезультата);
			РезультатВыполненияОбмена = Новый ФиксированнаяСтруктура(РезультатВыполнения);
			ПодключитьОбработчикОжидания("ВыгрузкаЖурналаРегистрации", ИнтервалОжидания, Истина);
		КонецЕсли;
		
	Иначе
		Закрыть(РезультатВыполнения());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаЖурналаРегистрации()
	
	ВыгрузкаЖурналаРегистрацииНаСервере();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаЖурналаРегистрацииНаСервере()
	
	ПараметрыПроцедуры = ПараметрыОтбораЖР();
	ИмяМетода = "ИнтеграцияУправлениеПерсоналом.ВыгрузкаЖурналаРегистрацииФоновоеЗадание";
	ЗапуститьФоновоеЗадание("ВыгрузкаЖурналаРегистрации", ИмяМетода, ПараметрыПроцедуры);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОтбораЖР()

	ИменаСобытий = ИнтеграцияУправлениеПерсоналом.ИменаСобытийЖР(Приложение);
	СобытияЖР = Новый Массив;
	Для каждого ЭлементКоллекции Из ИменаСобытий Цикл
		СобытияЖР.Добавить(ЭлементКоллекции.Значение);
	КонецЦикла;
	ОтборПоДатам = Новый Структура("ДатаНачала,ДатаОкончания");
	ОтборПоДатам.ДатаНачала 	= РезультатВыполненияОбмена.ДатаНачала;
	ОтборПоДатам.ДатаОкончания 	= РезультатВыполненияОбмена.ДатаОкончания;
	ОтборЖурналаРегистрации = ИнтеграцияУправлениеПерсоналом.ОтборЖурналаРегистрацииДляВыгрузки(СобытияЖР, ОтборПоДатам);
	
	Возврат Новый Структура("ОтборЖурналаРегистрации", ОтборЖурналаРегистрации);

КонецФункции

&НаКлиенте
Процедура ВыгрузкаЖурналаРегистрацииЗавершение(ФоновоеЗадание)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтотОбъект);
	
	ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохраненияФайла.Диалог.Фильтр = НСтр("ru = 'Данные журнала регистрации'") + "(*.zip)|*.zip";
	ИмяФайлаСРасширением = СтрШаблон("%1.%2", ИмяФайла, "zip");
	ФайловаяСистемаКлиент.СохранитьФайл(ОбработчикЗавершения, ФоновоеЗадание.АдресРезультата, ИмяФайлаСРасширением, ПараметрыСохраненияФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ПолноеИмяФайла = Результат[0].ПолноеИмя;
	КонецЕсли;
	
	Закрыть(РезультатВыполнения());

КонецПроцедуры

#КонецОбласти
